Картотека1/src/Catalogs/трс_НедвижимоеИмущество/трс_НедвижимоеИмущество.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>трс_НедвижимоеИмущество</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ОбъектКапитальногоСтроительства</name>
      <description>Объект капитального строительства</description>
    </items>
    <items>
      <name>ЗемельныйУчасток</name>
      <description>Земельный участок</description>
    </items>
  </predefined>
  <attributes>
    <name>УчетныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНедвижимости</name>
    <type>
      <types>EnumRef.трс_ТипНедвижимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмерениеПлощади</name>
    <type>
      <types>EnumRef.трс_ИзмерениеПлощади</types>
    </type>
  </attributes>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Этажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредКадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрава</name>
    <type>
      <types>EnumRef.трс_ВидПрава</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецАренды</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КадастроваяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъекта</name>
    <type>
      <types>EnumRef.трс_ВидОбъекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦелевоеИспользование</name>
    <type>
      <types>EnumRef.трс_ВидЦелевогоИспользованияЗдания</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.трс_ВидНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеЗдания</name>
    <type>
      <types>EnumRef.трс_ВидИспользованияЗдания</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗемель</name>
    <type>
      <types>EnumRef.трс_ВидКатегорииЗемель</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДокумент</name>
    <comment>Основной документ, хранящий информацию об объекте, как паспорт</comment>
    <type>
      <types>CatalogRef.трс_ВыпискаИзЕГРН</types>
      <types>CatalogRef.трс_СвидетельствоНаПравоСобственности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>CatalogRef.трс_ДоговорАренды</types>
      <types>CatalogRef.трс_СвидетельствоОНаследстве</types>
      <types>CatalogRef.трс_РазрешениеНаВводВЭксплуатацию</types>
      <types>CatalogRef.трс_ДоговорДолевогоУчастия</types>
      <types>CatalogRef.трс_ДоговорДарения</types>
      <types>CatalogRef.трс_ДоговорМены</types>
      <types>CatalogRef.трс_ДоговорСубаренды</types>
      <types>CatalogRef.трс_ДоговорКуплиПродажи</types>
    </type>
  </attributes>
  <attributes>
    <name>АктПриемаПередачи</name>
    <type>
      <types>CatalogRef.трс_АктПриемаПередачи</types>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоНаПравоСобственности</name>
    <type>
      <types>CatalogRef.трс_СвидетельствоНаПравоСобственности</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйКадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГосРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Правообладатель</name>
    <type>
      <types>CatalogRef.трс_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗемельныйУчасток</name>
    <type>
      <types>CatalogRef.трс_НедвижимоеИмущество</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРазрешенногоИспользования</name>
    <type>
      <types>CatalogRef.трс_ВидыРазрешенногоИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодЗавершенияСтроительства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НедвижимостьЛиквидирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоседниеОбъекты</name>
    <attributes>
      <name>КадастровыйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрикрепленныеФайлы</name>
    <attributes>
      <name>ПрикрепленныйДокумент</name>
      <type>
        <types>CatalogRef.трс_ФайловыйДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДругиеКадастровыеНомера</name>
    <attributes>
      <name>КадастровыйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОсновныеДокументы</name>
    <attributes>
      <name>ОсновнойДок</name>
      <type>
        <types>CatalogRef.трс_ДоговорЗалога</types>
        <types>CatalogRef.трс_ДоговорАренды</types>
        <types>CatalogRef.трс_АктПриемаПередачи</types>
        <types>CatalogRef.трс_ТехническийПлан</types>
        <types>CatalogRef.трс_ВыпискаИзЕГРН</types>
        <types>CatalogRef.трс_СвидетельствоНаПравоСобственности</types>
        <types>CatalogRef.трс_ДоговорДолевогоУчастия</types>
        <types>CatalogRef.трс_ДоговорДарения</types>
        <types>CatalogRef.трс_ДоговорМены</types>
        <types>CatalogRef.трс_ДоговорСубаренды</types>
        <types>CatalogRef.трс_ДоговорКуплиПродажи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлощадьПоДокументу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеДокументы</name>
    <attributes>
      <name>ДополнительныйДок</name>
      <type>
        <types>CatalogRef.трс_СитуационныйПлан</types>
        <types>CatalogRef.трс_ПисьмоОрганов</types>
        <types>CatalogRef.трс_СхемаРазмещения</types>
        <types>CatalogRef.трс_Декларация</types>
        <types>CatalogRef.трс_СправкаОКадастровойСтоимости</types>
        <types>CatalogRef.трс_Справка</types>
        <types>CatalogRef.трс_УведомлениеОЗавершенииСтроительства</types>
        <types>CatalogRef.трс_КадастровыйПаспорт</types>
        <types>CatalogRef.трс_УведомлениеОНачалеСтроительства</types>
        <types>CatalogRef.трс_СвидетельствоОНаследстве</types>
        <types>CatalogRef.трс_РазрешениеНаВводВЭксплуатацию</types>
        <types>CatalogRef.трс_РешениеСобственникаОРазделе</types>
        <types>CatalogRef.трс_ТехническийПаспорт</types>
        <types>CatalogRef.трс_ВыпискаИзИСОГД</types>
        <types>CatalogRef.трс_ПроектРеконструкции</types>
        <types>CatalogRef.трс_МежевойПлан</types>
        <types>CatalogRef.трс_ДополнительноеСоглашение</types>
        <types>CatalogRef.трс_СоглашенияОбУступкеПрав</types>
        <types>CatalogRef.трс_ТехническоеЗаключение</types>
        <types>CatalogRef.трс_ПостановлениеОПредоставленииЗемельногоУчастка</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлощадьПоДокументу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Картотека1/src/Catalogs/трс_НедвижимоеИмущество/ManagerModule.bsl
#Область ДляВызоваИзДругихПодсистем
// СтандартныеПодсистемы.ВерсионированиеОбъектов
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
    Реквизиты.Добавить("ПрикрепленныеФайлы.ДокументКомментарий");
    Реквизиты.Добавить("ОсновныеДокументы.ДокументКомментарий");
    Реквизиты.Добавить("ОсновныеДокументы.ПлощадьПоДокументу");
    Реквизиты.Добавить("ДополнительныеДокументы.ДокументКомментарий");
    Реквизиты.Добавить("ДополнительныеДокументы.ПлощадьПоДокументу");
    
КонецПроцедуры
#КонецОбласти
